# System dependencies
wget
netcat-traditional
gnupg
curl
unzip
zip
xvfb
libgconf-2-4
libxss1
libnss3
libnspr4
libasound2
libatk1.0-0
libatk-bridge2.0-0
libcups2
libdbus-1-3
libdrm2
libgbm1
libgtk-3-0
libxcomposite1
libxdamage1
libxfixes3
libxrandr2
xdg-utils
fonts-liberation
dbus
xauth
xvfb
x11vnc
tigervnc-tools
supervisor
net-tools
procps
git
python3-numpy
fontconfig
fonts-dejavu
fonts-dejavu-core
fonts-dejavu-extra
tmux
tesseract-ocr
nginx

# PDF Processing Tools
poppler-utils
wkhtmltopdf

# Document Processing Tools
antiword
unrtf
catdoc

# Text Processing Tools
grep
gawk
sed

# File Analysis Tools
file

# Data Processing Tools
jq
csvkit
xmlstarlet

# Additional Utilities
less
vim
tree
rsync
lsof
iputils-ping
dnsutils
sudo
trash-cli

# For Firecracker
openssh-server
